/* eslint-disable spaced-comment */
/* eslint-disable no-dupe-keys */
import React from 'react';
import PropTypes from 'prop-types';
import '../../css/content/Content.css';
import OwnerInfo from './Owner-Info';
import Post from './Post';

const Content = ({ profilePage }) => {
  const postElements = profilePage.posts.map((message) => (
    <Post
      message={message.message}
    />
  ));

  const formatYear = (year) => `20${year}`;

  const formatDate = (string) => {
    const [one, two, three] = string.split('.');
    return `${formatYear(three)}.${two}.${one}`;
  };

  //объявили массив объектов
  const workUnsort = [
    //в нем содержатся объекты под индексом
    { date: '17.09.19', description: '17.09.19; 4.3; 1эт; Л1; 8289 ЛМП; пер от 25.09; в/о 4-6/Б-В' },
    { date: '11.10.19', description: '11.10.19; 4.3; 1эт; Л2; ЛПМ-8289,8499; пер. от 28.09.2019; в/о 11-12/Б-В' },
    { date: '11.10.19', description: '11.10.19; 4.3; 1эт; Л3; лпм-8289,8499; пер. от 28.09.2019; в/о 22-23/Б-В' },
    { date: '12.09.19', description: '12.09.19; 4.3; 1эт; Л4; перем. пасп. от 25.04; ЛМП 8252-3шт; в/о 27-28/Б-В' },
    { date: '23.03.20', description: '23.03.2020; 4.3; 2эт; Л1,Л2; перем № 308; ЛПМ-859-4шт' },
    { date: '24.03.20', description: '24.03.2020; 4.3; 2эт; Л3,Л4; пер № 308; ЛПМ-1210-4шт' },
    { date: '16.04.20', description: '16.04.20; 4.3; 3эт; Л1,Л2; пер №1761/04-20-4шт; ЛМП-859-4шт; Р1М100-273' },
    { date: '09.04.20', description: '09.04.20; 4.3; 3эт; Л3,Л4; пер-484-4шт; ЛМП-1367-4шт; Р1М100-205' },
    { date: '20.05.20', description: '20.05.20; 4.3; 4эт; Л1,Л2,Л3,Л4; перемычка-0671-8шт; ЛМП-1876;1943-8шт; Раствор М75-2249;2351' },
    { date: '25.05.20', description: '25.05.20; 4.3; 5эт; Л1,Л2,Л3,Л4; перемычка-1951/05-20-8шт; ЛМП-2019;17-84-8шт; Раствор М75-2243' },
    { date: '25.06.20', description: '25.06.20; 4.3; 6эт; Л1,Л2,Л3,Л4; перемычка-0863-8шт; ЛМП-2170,2280-8шт; Раствор М100 №4859' },
    { date: '28.06.20', description: '28.06.20; 4.3; 7эт; Л1,Л2,Л3,Л4; перемычка-0863-8шт; ЛМП-2364,2476-8шт; Раствор М100 №5059' },
    { date: '17.07.20', description: '17.07.20; 4.3; 8эт; Л1,Л2,Л3,Л4; перемычка-903-8шт; ЛМП-2584, 14-196; Раствор М100 №6684' },
    { date: '17.07.20', description: '17.07.20 и 18.07.20 ; 4.3; 9эт; Л1,Л2,Л3,Л4; перемычка-903 ; ЛМП-2821,14-196; Раствор М100 №6684 в 17ого и №6774 в 18ого' },
    { date: '06.08.20', description: '06.08.20 ; 4.3; 10эт; Л1,Л2,Л3,Л4; перемычка-1148 ; ЛМП-2821,2867 ; Раствор М100 №8327' },
    { date: '10.08.20', description: '10.08.20 ; 4.3; 11эт; Л1,Л2,Л3,Л4; перемычка-2639/08-20 ; ЛМП-14-196,14-307 ; Раствор М100 №8625' },
    { date: '01.09.20', description: '01.09.20 ; 4.3; 12эт; Л1,Л2,Л3,Л4; перемычка-1503 ; ЛМП-3275,3297 ; Раствор М100 №10394' },
    { date: '08.09.20', description: '08.09.20 ; 4.3; 13эт; Л1,Л2,Л3,Л4; перемычка-2791/09-20 ; ЛМП-3238,3571 ; Раствор М100 №10835' },
    { date: '12.05.20', description: '12.05.20; блок 4.3; 3эт; Вентблоки №259' },
    { date: '18.05.20', description: '18.05.20; блок 4.3; 4эт; Вентблоки №1918/04-20' },
    { date: '27.05.20', description: '27.05.20; блок 4.3; 5эт; Вентблоки №365' },
    { date: '25.06.20', description: '25.06.20; блок 4.3; 6эт; Вентблоки №386' },
    { date: '25.06.20', description: '25.06.20 и 03.07.20; блок 4.3; 7эт; Вентблоки №412' },
    { date: '23.07.20', description: '23.07.20; блок 4.3; 8эт;  Вентблоки №474' },
    { date: '06.08.20', description: '06.08.20; блок 4.3; 9эт; Вентблоки №562' },
    { date: '14.08.20', description: '14.08.20; блок 4.3; 10эт; Вентблоки №575' },
    { date: '24.08.20', description: '24.08.20; блок 4.3; 11эт; Вентблоки №641' },
    { date: '01.09.20', description: '01.09.20 и 05.09.20; блок 4.3; 12эт; Вентблоки №662' },
    { date: '25.09.20', description: '25.09.20; блок 4.3; 13эт; Вентблоки №707' },
    { date: '01.10.20', description: '01.10.20; блок 4.3; КРОВЛЯ; Вентблоки №2835/09-20, 2856/09-20' },
    { date: '17.08.20', description: '17.08.20 ; блок 4.1; 3эт; Вентблоки №630' },
    { date: '09.09.20', description: '09.09.20 ; блок 4.1; 4эт; Вентблоки №641' },
    { date: '07.10.20', description: '07.10.20 ; блок 4.1; 5эт; Вентблоки №831' },
    { date: '10.11.20', description: '10.11.20 ; блок 4.1; 6эт; Вентблоки №794' },
    { date: '12.11.20', description: '12.11.20 ; блок 4.1; 7эт; Вентблоки №768' },
    { date: '22.11.20', description: '22.11.20 ; блок 4.1; 8эт; Вентблоки №890' },
    { date: '29.12.20', description: '29.12.20 ; блок 4.1; 9эт; Вентблоки №1023' },
    { date: '12.01.21', description: '12.01.21 ; блок 4.1; 10эт; Вентблоки №1072' },
    { date: '02.02.21', description: '02.02.21 ; блок 4.1; 11эт; Вентблоки №1023' },
    { date: '06.02.21', description: '06.02.21 ; блок 4.1; 12эт; Вентблоки №19' },
    { date: '25.02.21', description: '25.02.21 ; блок 4.1; 13эт; Вентблоки №97,149' },
    { date: '17.02.21', description: '17.02.21-04.03.21 ; блок 4.1; КРОВЛЯ; Вентблоки №3236/01-21, 3261/02-21, 3286/02-21' },
    { date: '11.09.20', description: '11.09.20; блок 4.1; 4-5эт; Л4; перемычка-1556; ЛМП-15-096;' },
    { date: '17.09.20', description: '17.09.20 ; блок 4.1; 5-6эт; Л4; перемычка-1556; ЛМП-15-096;' },
    { date: '17.09.20', description: '17.09.20 ; блок 4.1; 5-6эт; Л1; перемычка-1556; ЛМП-2605;' },
    { date: '01.10.20', description: '01.10.20 ; блок 4.1; 6-7эт; Л1; перемычка-1721; ЛМП-15-148,16-086;' },
    { date: '01.10.20', description: '01.10.20 ; блок 4.1; 5-6эт; Л2,3; перемычка-1721; ЛМП-15-148,16-086;' },
    { date: '03.11.20', description: '03.11.20 ; блок 4.1; 7-8эт; Л1; перемычка-1722; ЛМП-17-014,18-006;' },
    { date: '03.11.20', description: '03.11.20 ; блок 4.1; 6-8эт; Л2,3,4; перемычка-1722; ЛМП-17-014,18-006;' },
    { date: '01.12.20', description: '01.12.20 ; блок 4.1; 8-9эт; Л1,2,3,4; перемычка-2068; ЛМП-3771;' },
    { date: '12.01.21', description: '12.01.21 ; блок 4.1; 9-10эт; Л1,2,3,4; перемычка-3145/12-20; ЛМП-4125,4186;' },
    { date: '13.01.21', description: '13.01.21 ; блок 4.1; 10-11эт; Л1,2,3,4; перемычка-2254; ЛМП-4284;' },
    { date: '03.02.21', description: '03.02.21 ; блок 4.1; 11-12эт; Л1,2,3,4; перемычка-3236/01-21; ЛМП-4043,302;' },
    { date: '06.02.21', description: '06.02.21 ; блок 4.1; 12-13эт; Л1,2,3,4; перемычка-3236/01-21; ЛМП-4043,302;' },
    { date: '01.09.20', description: '01.09.20 ; блок 4.2; 1-2эт; Л1,2; перемычка-2639/08-20; ЛМП-15-076;' },
    { date: '06.10.20', description: '06.10.20 ; блок 4.2; 3-5эт; Л1,2; перемычка-1721; ЛМП-2739;' },
    { date: '01.12.20', description: '01.12.20 ; блок 4.2; 5-7эт; Л1,2; перемычка-2068; ЛМП-2899,3083;' },
    { date: '13.01.21', description: '13.01.21 ; блок 4.2; 7-8эт; Л1,2; перемычка-2254; ЛМП-23-086;' },
    { date: '17.01.21', description: '17.01.21 ; блок 4.2; 8-9эт; Л1,2; перемычка-2254; ЛМП-4043;' },
    { date: '18.01.21', description: '18.01.21 ; блок 4.2; 9-10эт; Л1,2; перемычка-2254; ЛМП-55;' },
    { date: '03.02.21', description: '03.02.21 ; блок 4.2; 10-11эт; Л1,2; перемычка-3224/01-21; ЛМП-23-086;' },
    { date: '06.02.21', description: '06.02.21 ; блок 4.2; 11-12эт; Л1,2; перемычка-3237/01-21; ЛМП-4284;' },
    { date: '17.02.21', description: '17.02.21 ; блок 4.2; 12-13эт; Л1,2; перемычка-0144; ЛМП-349;' },
    { date: '14.10.20', description: '14.10.20 ; блок 4.2; 3эт; Вентблоки-707' },
    { date: '16.10.20', description: '16.10.20 ; блок 4.2; 4эт; Вентблоки-729' },
    { date: '12.11.20', description: '12.11.20 ; блок 4.2; 5эт; Вентблоки-869' },
    { date: '26.11.20', description: '26.11.20 ; блок 4.2; 6эт; Вентблоки-928' },
    { date: '30.11.20', description: '30.11.20 ; блок 4.2; 7эт; Вентблоки-956' },
    { date: '15.12.20', description: '15.12.20 ; блок 4.2; 8эт; Вентблоки-1016' },
    { date: '03.02.21', description: '03.02.21 ; блок 4.2; 9эт; Вентблоки-3206/01-21' },
    { date: '06.02.21', description: '06.02.21 ; блок 4.2; 10эт; Вентблоки-1072' },
    { date: '25.02.21', description: '25.02.21 ; блок 4.2; 11эт; Вентблоки-3235/01-21' },
    { date: '03.03.21', description: '03.03.21 ; блок 4.2; 12эт; Вентблоки-3206/01-21,3223/01-21' },
    { date: '05.03.21', description: '05.03.21 ; блок 4.2; 13эт; Вентблоки-149' },
    { date: '06.03.21', description: '06.03.21 ; блок 4.2; КРОВЛЯ; Вентблоки-3338/02-21' },
    { date: '01.03.20', description: '01.03.20-21.03.20 ; блок 4.3; 2эт; Перемычки-308' },
    { date: '27.03.20', description: '27.03.20-12.04.20 ; блок 4.3; 3эт; Перемычки-1613/03-20' },
    { date: '13.04.20', description: '13.04.20-25.04.20 ; блок 4.3; 4эт; Перемычки-1761/04-20' },
    { date: '27.04.20', description: '27.04.20-11.05.20 ; блок 4.3; 5эт; Перемычки-1885/04-2' },
    { date: '12.05.20', description: '12.05.20-26.05.20 ; блок 4.3; 6эт; Перемычки-1951/05-20' },
    { date: '27.05.20', description: '27.05.20-10.06.20 ; блок 4.3; 7эт; Перемычки-0863' },
    { date: '11.06.20', description: '11.06.20-23.06.20 ; блок 4.3; 8эт; Перемычки-903' },
    { date: '24.06.20', description: '24.06.20-09.07.20 ; блок 4.3; 9эт; Перемычки-2405/07-20' },
    { date: '08.07.20', description: '08.07.20-24.07.20 ; блок 4.3; 10эт; Перемычки-1148' },
    { date: '27.07.20', description: '27.07.20-08.08.20 ; блок 4.3; 11эт; Перемычки-2639/08-20' },
    { date: '09.08.20', description: '09.08.20-24.08.20 ; блок 4.3; 12эт; Перемычки-1503' },
    { date: '26.08.20', description: '26.08.20-09.09.20 ; блок 4.3; 13эт; Перемычки-2791/09-20' },
    { date: '25.05.20', description: '25.05.20-19,07,20 ; блок 4.3; 3эт; Перемычки-819' },
    { date: '27.07.20', description: '27.07.20-11.08.20 ; блок 4.3 перегородки; 4эт; Перемычки-1635' },
    { date: '08.06.20', description: '08.06.20-19.07.20 ; блок 4.3 перегородки; 5эт; Перемычки-0980' },
    { date: '30.06.20', description: '30.06.20-11.08.20 ; блок 4.3 перегородки; 6эт; Перемычки-1365' },
    { date: '21.07.20', description: '21.07.20-02.09.20 ; блок 4.3 перегородки; 7эт; Перемычки-1365' },
    { date: '12.08.20', description: '12.08.20-14.09.20 ; блок 4.3 перегородки; 8эт; Перемычки-1642' },
    { date: '02.09.20', description: '02.09.20-03.10.20 ; блок 4.3 перегородки; 9эт; Перемычки-1720' },
    { date: '08.09.20', description: '08.09.20-03.10.20 ; блок 4.3 перегородки; 10эт; Перемычки-1642' },
    { date: '15.09.20', description: '15.09.20-03.10.20 ; блок 4.3 перегородки; 11эт; Перемычки-1642' },
    { date: '07.10.20', description: '07.10.20-06.11.20 ; блок 4.3 перегородки; 13эт; Перемычки-1822' },
    { date: '20.06.20', description: '20.06.20-26.08.21 ; блок 4.3 перегородки; подвал; Перемычки-903' },
    { date: '02.09.20', description: '02.09.20-08.09.20 ; блок 4.1 стены; 5эт; Перемычки-1433' },
    { date: '15.09.20', description: '15.09.20-09.10.20 ; блок 4.1 стены; 6эт; Перемычки-1721' },
    { date: '08.10.20', description: '08.10.20-24.10.20 ; блок 4.1 стены; 7эт; Перемычки-1722' },
    { date: '26.10.20', description: '26.10.20-09.11.20 ; блок 4.1 стены; 8эт; Перемычки-1973' },
    { date: '10.11.20', description: '10.11.20-23.11.20 ; блок 4.1 стены; 9эт; Перемычки-1974' },
    { date: '26.11.20', description: '26.11.20-09.12.20 ; блок 4.1 стены; 10эт; Перемычки-2068 & 2155' },
    { date: '12.12.20', description: '12.12.20-23.12.20 ; блок 4.1 стены; 11эт; Перемычки-2069' },
    { date: '25.12.20', description: '25.12.20-17.01.21 ; блок 4.1 стены; 12эт; Перемычки-2254' },
    { date: '18.01.21', description: '18.01.21-30.01.21 ; блок 4.1 стены; 13эт; Перемычки-3237/01-21' },
    { date: '16.10.20', description: '16.10.20-12.12.20 ; блок 4.1 перегородки; 4эт; Перемычки-3036/11-20' },
    { date: '11.11.20', description: '11.11.20-25.12.20 ; блок 4.1 перегородки; 5эт; Перемычки-3123/12-20' },
    { date: '29.12.20', description: '29.12.20-06.03.21 ; блок 4.1 перегородки; 8эт; Перемычки-3112/02-21' },
    { date: '06.02.21', description: '06.02.21-05.04.21 ; блок 4.1 перегородки; 11эт; Перемычки-3312/02-21' },
    { date: '04.08.20', description: '04.08.20-22.08.20 ; блок 4.2 стены; 2эт; Перемычки-1503' },
    { date: '04.08.20', description: '04.08.20-17.09.20 ; блок 4.2 стены; 3эт; Перемычки-1503' },
    { date: '18.09.20', description: '18.09.20-01.10.20 ; блок 4.2 стены; 4эт; Перемычки-2857/09-20' },
    { date: '02.10.20', description: '02.10.20-17.10.20 ; блок 4.2 стены; 5эт; Перемычки-1722' },
    { date: '21.10.20', description: '21.10.20-29.10.20 ; блок 4.2 стены; 6эт; Перемычки-1722' },
    { date: '05.11.20', description: '05.11.20-11.11.20 ; блок 4.2 стены; 7эт; Перемычки-2992/11-20' },
    { date: '23.11.20', description: '23.11.20-28.11.20 ; блок 4.2 стены; 8эт; Перемычки-2068' },
    { date: '08.12.20', description: '15.12.20 ; блок 4.2 стены; 9эт; Перемычки-3122/12-20' },
    { date: '23.12.20', description: '23.12.20-29.12.20 ; блок 4.2 стены; 10эт; Перемычки-3122/12-20' },
    { date: '17.01.21', description: '17.01.21-21.01.21 ; блок 4.2 стены; 11эт; Перемычки-2254' },
    { date: '30.01.21', description: '30.01.21-04.02.21 ; блок 4.2 стены; 12эт; Перемычки-3237/01-21' },
    { date: '15.02.21', description: '15.02.21-22.02.212 ; блок 4.2 стены; 13эт; Перемычки-3224/01-21 & 3227/01-21' },
    { date: '16.10.20', description: '16.10.20-03.12.20 ; блок 4.2 перегородки; 2эт; Перемычки-3067/20-11' },
    { date: '11.11.20', description: '11.11.20-14.12.20 ; блок 4.2 перегородки; 3эт; Перемычки-2070' },
    { date: '13.01.21', description: '13.01.21-25.01.21 ; блок 4.2 перегородки; 4эт; Перемычки-3123/12-20' },
    { date: '27.01.21', description: '27.01.21-01.03.21 ; блок 4.2 перегородки; 5эт; Перемычки-0146 & 0144' },
    { date: '02.03.21', description: '02.03.21-29.03.21 ; блок 4.2 перегородки; 6эт; Перемычки-0146' },
    { date: '25.03.21', description: '25.03.21-17.04.21 ; блок 4.2 перегородки; 7эт; Перемычки-3439' },
    { date: '19.03.21', description: '19.03.21-22.04.21 ; блок 4.2 перегородки; 8эт; Перемычки-3891' },
    { date: '07.04.21', description: '07.04.21-02.05.21 ; блок 4.2 перегородки; 9эт; Перемычки-3491/04-21' },
    { date: '20.04.21', description: '20.04.21-07.05.21 ; блок 4.2 перегородки; 10эт; Перемычки-389' },
  ];

  const work = {};

  workUnsort.forEach(({ date, description }) => {
    const key = formatDate(date);

    const currentDescription = work[key];

    if (currentDescription !== undefined) {
      work[key] = [...currentDescription, description];
    } else {
      work[key] = [description];
    }
  });

  return (
    <div className="content">
      <OwnerInfo />
      { postElements }

      { Object.keys(work).sort().map((key) => {
        const descriptions = work[key];
        return (
          <div style={{ marginBottom: '15px' }}>
            {key}
            {descriptions.map((description) => (
              <div>
                {description}
              </div>
            ))}
          </div>
        );
      }) }

    </div>
  );
};

Content.propTypes = {
  profilePage: PropTypes.element.isRequired,
};

export default Content;
